{"Hot House Districts 2014":[{"district":"1B","pvi":-3.842167034,"current":"R","lean2012":3.95,"leanpres":5.8,"type":"watch","candidater":"Debra Kiel","candidated":"Eric Bergeson","candidatei":"","incumbentparty":"R","description":"Democrats are bullish about their chances to take back a couple of seats they lost in 2010 in northwestern Minnesota. That includes House District 1B, currently held by two-term Republican Rep. Deb Kiel, who won the 2012 election by less than 5 percent of the vote. Democrats have recruited Eric Bergeson, a 2011 Bush fellow, author and motivational speaker on one of the big issues up in the district: caring for aging populations. But most pundits say it’s Kiel’s race to lose in a low-turnout midterm election.","rowNumber":1},{"district":"2A","pvi":-4.387150035,"current":"D","lean2012":-9.31,"leanpres":2.01,"type":"watch","candidater":"Dave Hancock","candidated":"Roger Erickson","candidatei":"","incumbentparty":"D","description":"Like many races this cycle, the contest for House District 2A is a rematch. Freshman DFL Rep. Roger Erickson is defending his seat from Republican Dave Hancock, a retired small business owner from Bemidji who held the seat before Erickson did. Erickson is fighting the conservative leanings of his district and the fact that he voted in favor of legalizing gay marriage last year (his district voted by nearly 60 percent to ban gay marriage in 2012). But Erickson is a popular retired schoolteacher and high school football coach from Baudette, and many think his local name recognition could help him stave off an upset this fall.","rowNumber":2},{"district":"2B","pvi":-0.116624542,"current":"R","lean2012":2,"leanpres":13.85,"type":"watch","candidater":"Steve Green","candidated":"David Sobieski","candidatei":"","incumbentparty":"R","description":"Neither Republicans or Democrats know exactly how to read the 2012 election in House District 2B, where Republican Rep. Steve Green survived a challenge from former DFL Rep. Brita Sailer by just 2 points. The complicating factor in that race: hundreds of thousands of dollars were spent on the race from outside groups on both sides. Democrats are targeting the race again this year, but they’ve fielded a newcomer candidate in David Sobieski, a small business owner and Air Force veteran. Sobieski has labeled himself a \"blue dog\" Democrat &mdash; much like the area’s moderate congressman, Collin Peterson &mdash; to appeal to district’s swing voters.","rowNumber":3},{"district":"10B","pvi":-4.351757483,"current":"D","lean2012":-1.47,"leanpres":9.05,"type":"watch","candidater":"Dale K. Lueck","candidated":"Joe Radinovich","candidatei":"","incumbentparty":"D","description":"DFL Rep. Joe Radinovich is constantly reminded of the number 323. That’s how many votes the freshman from Crosby won by in 2012, which speaks to the challenge he faces this cycle. Republicans have gone after Radinovich for voting to legalizing gay marriage, despite the fact that his district voted more than 62 percent in favor of banning gay marriage in 2012. Radinovich’s vote was subject to a short-lived but well-publicized recall effort, and it’s coming up on the campaign trail, too. Gay marriage or not, Radinovich was going to have a hard slog to retain his seat &mdash; it leans Republican and he won it in a strong year for Democrats. But operatives note that Radinovich is a dedicated campaigner, which is why this race has toss up written all over it.","rowNumber":4},{"district":"11B","pvi":-0.512959063,"current":"D","lean2012":-2.66,"leanpres":4.18,"type":"watch","candidater":"Jason Rarick","candidated":"Tim Faust","candidatei":"","incumbentparty":"D","description":"The Hinckley-area is as politically swingy as they come in greater Minnesota, and no one knows that better that DFL Rep. Tim Faust. He was first elected in the anti-Bush wave of 2006, but he was booted from his seat in the Republican tsunami of 2010. He was welcomed back into the Legislature after the 2012 election, but Democrats are still afraid of whiplash. Republicans have fielded first-time candidate Jason Rarick, an electrician by trade who is running as a straight-talking, common sense Minnesotan. This is another district where some operatives say gay marriage could matter &mdash; Faust, a Lutheran minister, supported legalizing gay marriage last year despite his district’s support for banning it in 2012.","rowNumber":5},{"district":"17B","pvi":-0.257265384,"current":"D","lean2012":-4.17,"leanpres":4.08,"type":"watch","candidater":"Dave Baker","candidated":"Mary Sawatzky","candidatei":"","incumbentparty":"D","description":"The Willmar area has swung back and forth between political parties for the last three election cycles, making it a target for both this year. Incumbent DFL Rep. Mary Sawatzky was one of only two Democrats in her caucus to vote against a bill to legalize gay marriage, after her district supported a constitutional gay marriage ban in 2012. The vote has protected her from attacks on that issue, but she’s already weathering other criticisms from Republican groups trying to tie her to $2 billion in tax increases over the last two years and to MNsure. Her opponent, Republican David Baker, owns a handful of hotels and investment properties in the district.","rowNumber":6},{"district":"27A","pvi":-3.221256476,"current":"D","lean2012":-3.2,"leanpres":-13.22,"type":"watch","candidater":"Peggy Bennett","candidated":"Shannon Savick","candidatei":"Thomas Keith Price","incumbentparty":"D","description":"The House seat that includes the city of Austin in southern Minnesota is known for it’s close contests, and this year will likely be no different. In 2010, former GOP Rep. Rich Murray snatched the seat from an incumbent Democrat by less than a half of a percentage point. Two years later, DFLer Shannon Savick, a former mayor of Wells, won the seat from Murray by about 2 percent, in an election that saw Independence Party candidate William Wagner received 7.7 percent of the vote. A similar dynamic is shaping up this year: Savick is defending her seat from Republican Peggy Bennett, a local schoolteacher, and the Independence Party has fielded candidate Thomas Prince, who has kept a low profile in the race so far.","rowNumber":7},{"district":"48A","pvi":-2.040107947,"current":"D","lean2012":-0.82,"leanpres":-5.93,"type":"watch","candidater":"Kirk Stensrud","candidated":"Yvonne Selcer","candidatei":"","incumbentparty":"D","description":"DFL Rep. Yvonne Selcer won her Minnetonka-area House seat two years ago by less than 1 percent of the vote &mdash; and that was a good year for Democrats. Republicans are betting they can steal the seat back this year in a low-turnout election. Former Republican Rep. Kirk Stensrud, who held the seat before Selcer, is trying to return to the Legislature this cycle, and he’s getting help from groups like the Minnesota Chamber of Commerce. But the race could turn on education issues in the suburban district &mdash; Stensrud is pushing for more local control for districts, while Selcer, a former school teacher, is touting Democrats’ repayment of the state’s \"school shift\" and investments in all-day kindergarten.","rowNumber":8},{"district":"49A","pvi":-1.154977486,"current":"D","lean2012":-11.72,"leanpres":-5.6,"type":"watch","candidater":"Dario Anselmo","candidated":"Ron Erhardt","candidatei":"","incumbentparty":"D","description":"DFL Rep. Ron Erhardt isn’t a easy target. He spent his first nine terms in the House as a popular moderate Republican before he was ousted in 2008 for supporting a gas tax increase. When he decided to run again in 2012, Erhardt did so as a Democrat. And over the last two years in the Legislature, he’s voted like someone who toes the line between both parties, a good fit for the politically volatile Edina House district he represents. But he has a strong challenger in Dario Anselmo, the former owner of the Fine Line Music Café and founder of the Minneapolis Warehouse District Business Association. It’s Anselmo’s first stab at public office, but he’s proven to be an adept fundraiser and campaigner, Republicans say, making this a race to watch this cycle.","rowNumber":9},{"district":"49B","pvi":3.211975607,"current":"D","lean2012":-6.76,"leanpres":-6.25,"type":"watch","candidater":"Barb Sutter","candidated":"Paul Rosenthal","candidatei":"","incumbentparty":"D","description":"There’s good reason DFL Rep. Paul Rosenthal was one of a handful of legislators who was able to break from the party on tough votes in 2013. Rosenthal, a foreign currency trader from Edina, was first elected in 2008, but he lost his seat in the GOP wave of 2010. He made it back to the Legislature in 2012, and DFL leadership wants to keep him there. His Republican opponent, Barbara Sutter, is a former tax accountant who has been involved in local politics for years. She’s talking mostly about the state’s tax climate, jobs and opposition to the new health insurance exchange in the business-friendly suburban district.","rowNumber":10},{"district":"51A","pvi":-4.796473124,"current":"D","lean2012":-11.21,"leanpres":-13.06,"type":"watch","candidater":"Andrea Todd-Harlin","candidated":"Sandra Masin","candidatei":"","incumbentparty":"D","description":"It’s a familiar tale in the Twin Cities suburbs &mdash; DFLers were swept into districts during the anti-Bush years of 2006 and 2008 and quickly swept back out in 2010 over the healthcare overhaul. Many, like DFL Rep. Sandra Masin in Eagan, successfully reclaimed their seat in the 2012 and hoping to keep it through this midterm election. Masin won with more than 10 percent of the vote last fall, but the district usually swings with the national political winds. As of the last campaign finance reporting deadline, her Republican opponent Andrea Todd-Harlin had kept pace with Masin on fundraising.","rowNumber":11},{"district":"51B","pvi":-0.709947338,"current":"D","lean2012":-3.87,"leanpres":-4.64,"type":"watch","candidater":"Jen Wilson","candidated":"Laurie Halverson","candidatei":"","incumbentparty":"D","description":"Freshman DFL Rep. Laurie Halverson could be the Amy Klobuchar of local politics. Much like the state’s popular U.S. senator, Halverson put her head down in her first term to work on non-controversial issue like cutting back on homelessness and youth smoking. A former employee of Blue Cross, Halverson was also the lone DFL House member to vote against the bill to create a health insurance exchange, doing so over the lack of health care industry representation on the exchange board, and she got the highest marks of any Democrat in the House from the Minnesota Chamber of Commerce. But the Eagan House district has swung back and forth over the last few elections, and her opponent, community activist Jen Wilson, will see funds flood into her race from outside groups this fall.","rowNumber":12},{"district":"12A","pvi":7.143330362,"current":"D","lean2012":-1.2,"leanpres":5.39,"type":"watch","candidater":"Jeff Backer","candidated":"Jay McNamar","candidatei":"","incumbentparty":"D","description":"Former Elbow Lake Mayor Jay McNamar's victory was one of the noteworthy pickups for Democrats in the 2012 election: He won by about 1 point in a west central Minnesota House district that most expected to swing Republican. But that year a strong Independence Party candidate, Dave Holman, earned more than 6 percent of the vote. There’s no IP candidate this year, and Republicans see the race as one of their most likely pick-ups in the battle to regain the House. They’ve recruited businessman and Browns Valley School Board member Jeff Backer, who also served as Browns Valley mayor and four years on the city council.","rowNumber":13},{"district":"56B","pvi":5.670417123,"current":"D","lean2012":-0.8,"leanpres":-0.29,"type":"watch","candidater":"Roz Peterson","candidated":"Will Morgan","candidatei":"","incumbentparty":"D","description":"All eyes are on Burnsville, where one of the most competitive races in the fight for the House is shaping up. For starters, House District 56B is a classic swing district &mdash; it has flipped back and forth from Republican to Democratic control for the last three election cycles &mdash; and both candidates seeking to represent it have strong backgrounds. This year’s race is a rematch from 2012 between incumbent DFL Rep. Will Morgan, a high-school physics teacher, and Republican Roz Peterson, a Lakeville School Board member and former chair of the Dakota County Regional Chamber of Commerce. If the Democrats maintain control of this seat, expect them to hold on to other close swing seats across the state as well.","rowNumber":14},{"district":"14B","pvi":-12.61853235,"current":"D","lean2012":-12.73,"leanpres":-9.66,"type":"watch","candidater":"Jim Knoblach","candidated":"Zachary Dorholt","candidatei":"","incumbentparty":"D","description":"The St. Cloud area House district represented by freshman DFL Rep. Zachary Dorholt may lean Democratic, but he's facing a challenge this fall from a former six-term state representative with broader name recognition and a deeper campaign war chest. Republican Jim Knoblach, who has stayed active in local Republican politics since he left the House in 2006, has opted to forgo the public-subsidy agreement signed by most legislative candidates. That means he wont be restricted by any campaign spending limits, and he’s already raised considerably more than Dorholt. The district was a key battleground in 2012, when Dorholt won the seat from St. Cloud State University economics professor King Banaian. Pundits expect Knoblach to make the race competitive again this cycle.","rowNumber":15},{"district":"5B","pvi":-4.249005146,"current":"D","lean2012":-6.96,"leanpres":-0.89,"type":"radar","candidater":"Justin Eichorn","candidated":"Tom Anzelc","candidatei":"","incumbentparty":"D","description":"DFL Rep. Tom Anzelc, a fiery populist, has been in politics or state government in some form or another since Rudy Perpich was governor in the 1980s. He's proven a tough candidate to beat over the years, but his district picked up new conservative territory after redistricting, and Republicans are targeting the area after Republican Mitt Romney performed better than President Barack Obama here in 2012.","rowNumber":16},{"district":"10A","pvi":-14.12174276,"current":"D","lean2012":-14.1,"leanpres":12.74,"type":"radar","candidater":"Joshua Heintzeman","candidated":"John Ward ","candidatei":"","incumbentparty":"D","description":"Incumbent Rep. John Ward enjoys fairly broad popularity in his conservative leaning district, despite the fact that he's a Democrat. He was re-elected in his Crow Wing County district by about 7 percent of the vote in 2012, in a year when Romney trounced Obama there. But Republicans are trying to use the unpopular construction of the state Senate office building as a wedge in the district, claiming Ward was the deciding vote in favor of the project on the House Rules Committee last year. ","rowNumber":17},{"district":"36A","pvi":-6.1949472,"current":"R","lean2012":2.17,"leanpres":0.89,"type":"radar","candidater":"Mark W. Uglem","candidated":"Jefferson Fietek","candidatei":"","incumbentparty":"R","description":"Republican Rep. Mark Uglem won his Champlin-area House seat with a razor-thin margin in 2012, making him one of Democrats’ top pick up seats this election cycle. He’s being challenged by DFL-endorsed candidate Jefferson Fietek, a teacher in the Anoka-Hennepin school district who was an outspoken advocate for gay students during the bullying controversy in 2010.","rowNumber":18},{"district":"42A","pvi":-5.212494668,"current":"D","lean2012":-6.74,"leanpres":-4.96,"type":"radar","candidater":"Randy Jessup","candidated":"Barb Yarusso","candidatei":"","incumbentparty":"D","description":"Freshman DFL Rep. Barb Yarusso, a teacher from Shoreview, comfortably won her first term in the House in 2012. But the district still retains some of the conservative turf it held before redistricting, making it a target for some GOP groups this election cycle. Her opponent, Republican Randy Jessup, also lives in Shoreview and owns four UPS stores in the Twin Cities.","rowNumber":19},{"district":"44B","pvi":-5.691491551,"current":"D","lean2012":-11.79,"leanpres":-10.06,"type":"radar","candidater":"Ryan Rutzick","candidated":"Jon Applebaum","candidatei":"","incumbentparty":"","description":"House District 44B, an open seat covering the wealthy western ‘burbs like Minnetonka and Plymouth, is a place where a moderate Democrat can thrive. Even-keeled DFL Rep. John Benson represented the area for eight years in the state House, but his retirement has put control of the district in doubt for some. DFLer Jon Applebaum, an attorney from Minnetonka, survived a three-way primary in August to be the nominee this cycle. Republicans are hoping to see Minnetonka resident and small-business owner Ryan Rutzick in the Legislature next year.","rowNumber":20}]}